--データ削除
TRUNCATE TABLE Equipment CASCADE;

TRUNCATE TABLE Arms CASCADE;

TRUNCATE TABLE MobileSuit CASCADE;

--モビルスーツ
insert into
  MobileSuit
values
  (
    'as000178',
    'RX-78-02',
    'ガンダム',
    'lib/images/RX-78-02.PNG',
    18.0,
    18.0,
    43.4,
    60.0,
    'ミノフスキー・イヨネスコ型熱核反応炉',
    'ルナ・チタニウム合金',
    5700,
    1380,
    55500,
    '地球連邦軍がV作戦で開発した試作モビルスーツ。対MS戦闘を意識した白兵戦用の機体として、「V作戦」の母体となった「RX計画」に基づく素案のほぼ全てを盛り込み、コストを度外視したハイスペックマシンとして開発されている。',
    '一年戦争時に伝説的な活躍を残し、戦後も本機の活躍は伝説として語り継がれており、機体名称や頭部デザインを通して兵士の士気に影響するほど特別視されている。加えて、ガンダムの影響を受けた「ガンダムタイプ」と呼ばれる機体群がハイエンドMSの代名詞として扱われるなど、後年のモビルスーツ開発史にすら影響を及ぼしている。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

--武器
insert into
  Arms
values
  (
    '00000001',
    'XBR-M79-07G ビーム・ライフル',
    'ブラッシュ社製MS携帯式小型メガ粒子砲。出力1.9MW。エネルギーCAP技術によって初めて実用化したMS携行サイズのメガ粒子砲。一回のチャージにつき16発の発射が可能。フォアグリップと円形センサーを備え、長距離射撃にも対応可能。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Arms
values
  (
    '00000002',
    'ビーム・サーベル',
    '高エネルギー状態のミノフスキー粒子をIフィールドで収束させ、ビームの刀身を形成する。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Arms
values
  (
    '00000003',
    'RX・M-Sh-008/S-01025 ガンダムシールド',
    '防御用に用意された身の丈とほぼ同じ大きさの大盾。ルナ・チタニウム合金や高分子素材の樹脂などの三層構造を採用し、MS本体の装甲のような防御性能ではなく衝撃の吸収や分散を目的としている。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Arms
values
  (
    '00000004',
    '60mmバルカン砲',
    '近接防御用の火器で、MS用の火器としては小口径だが、近距離であればMSを撃破する事も可能な威力を発揮する。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Arms
values
  (
    '00000005',
    'BLASH XHB-L03/N-STD ハイパー・バズーカ',
    'ブラッシュ社製。肩掛け式の単砲身ロケット砲。口径は380mmまたは320mm。固定式の弾倉に5発次弾のロケット弾が装填されている。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

--装備
insert into
  Equipment
values
  (
    'as000178',
    '00000001',
    1,
    '初めてその威力を見せられたシャアに「あのMSは戦艦並みのビーム兵器を持っているというのか」と言わしめた。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Equipment
values
  (
    'as000178',
    '00000002',
    2,
    'ガンダム専用の近接白兵武装。出力0.38MW。<br>斬撃・刺突の双方で高い攻撃力を発揮し、1秒弱で厚さ30cmのチタニウム鋼を切断する事が可能。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Equipment
values
  (
    'as000178',
    '00000003',
    2,
    '非使用時には上部マウントラッチを介してバックパックに装着可能。Gアーマー時には両手に装着し、分離後は2枚を重ねて左手に装備する。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Equipment
values
  (
    'as000178',
    '00000004',
    1,
    '頭部を旋回させる事で射角を変更出来るため使い勝手が良く、この頭部固定兵装のレイアウトは以降の連邦系MSのスタンダードにもなっている。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );

insert into
  Equipment
values
  (
    'as000178',
    '00000005',
    1,
    '対艦用の実体弾武装だが対MS戦にも使用でき、ジムも装備している。',
    '2022-02-13 11:41:23',
    '2022-02-13 11:41:23',
    1
  );